In [ ]:
#from werkzeug.security import generate_password_hash
#print(generate_password_hash("test"))

In [1]:
import sqlite3
import pandas as pd

In [2]:
db_file = "database.db"

In [3]:
conn = sqlite3.connect(db_file)
cursor = conn.cursor()

In [34]:
df

   user_id user_name password
0        0   matthew  matthew
1        1       amy      amy
2        2     scott    scott
3        3     emily    emily

In [5]:
#add munros table
table_name = "munros"

df = pd.read_csv("munros_table.csv")

columns = ", ".join([f'"{col}" TEXT' for col in df.columns])
cursor.execute(f'CREATE TABLE IF NOT EXISTS {table_name} ({columns});')

df.to_sql(table_name, conn, if_exists="replace", index=False)

conn.commit()

In [32]:
cursor.execute("SELECT * FROM munros")
rows = cursor.fetchall()
for row in rows[:5]:
    print(row)

(0, 'Ben Nevis [Beinn Nibheis]', '04A: Fort William to Loch Treig & Loch Leven', 'Highland', 1344, 56.796891, -5.003675)
(1, 'Ben Macdui [Beinn Macduibh]', '08A: Cairngorms', 'Aberdeenshire/Moray', 1309, 57.070368, -3.669099)
(2, 'Braeriach', '08A: Cairngorms', 'Aberdeenshire/Highland', 1296, 57.078298, -3.728373)
(3, 'Cairn Toul', '08A: Cairngorms', 'Aberdeenshire', 1291, 57.054406, -3.710757)
(4, 'Sgor an Lochain Uaine', '08A: Cairngorms', 'Aberdeenshire', 1258, 57.058376, -3.725897)

In [6]:
#add users table
table_name = "users"

users = ["matthew",
        "amy",
        "scott", 
        "emily"]

ids = list(range(len(users)))

passwords = ["matthew",
            "amy",
            "scott", 
            "emily"]

df  = pd.DataFrame({
                    "user_id": ids,
                    "user_name": users,
                    "password": passwords
                  })

columns = ", ".join([f'"{col}" TEXT' for col in df.columns])
cursor.execute(f"CREATE TABLE IF NOT EXISTS {table_name} ({columns});")

df.to_sql(table_name, conn, if_exists="replace", index=False)

conn.commit()

In [33]:
cursor.execute("SELECT * FROM users")
rows = cursor.fetchall()
for row in rows[:5]:
    print(row)

(0, 'matthew', 'matthew')
(1, 'amy', 'amy')
(2, 'scott', 'scott')
(3, 'emily', 'emily')

In [8]:
#add junction bag table
create_junction_table = """
                        CREATE TABLE bags (
                        event_id INTEGER PRIMARY KEY,
                        user_id INTEGER NOT NULL,
                        munro_id INTEGER NOT NULL,
                        date TEXT,
                        notes TEXT,                 
                        FOREIGN KEY (user_id) REFERENCES users(user_id),
                        FOREIGN KEY (munro_id) REFERENCES munros(munro_id)
                        );
                        """

In [9]:
cursor.execute("DROP TABLE IF EXISTS bags;")
cursor.execute(create_junction_table)

In [ ]:
#add new user to users
add_user = """INSERT INTO users (user_name, password)
            VALUES 
                ("pete", "pass")
            """

In [10]:
#add new bag to junction bags
add_bag = """INSERT INTO bags (user_id, munro_id, date, notes)
            VALUES 
                (0, 0, '2025-08-26', 'Reached summit in 3 hours'),
                (1, 0, '2025-08-20', 'Nice view'),
                (0, 1, '2025-08-22', 'Sunny day');
            """

In [11]:
cursor.execute(insert_bag)

In [28]:
user_query = """SELECT u.user_id, u.user_name, m.munro_id, m.name, b.date, b.notes
            FROM bags b
            JOIN users u ON b.user_id = u.user_id
            JOIN munros m ON b.munro_id = m.munro_id
            WHERE u.user_id = 0;
            """

In [23]:
munro_query = """SELECT u.user_id, u.user_name, m.munro_id, m.name, b.date
            FROM bags b
            JOIN users u ON b.user_id = u.user_id
            JOIN munros m ON b.munro_id = m.munro_id
            WHERE m.munro_id = 0;
            """

In [30]:
#get all bags by user
cursor.execute(user_query)
rows = cursor.fetchall()
for row in rows[:5]:
    print(row)

(0, 'matthew', 0, 'Ben Nevis [Beinn Nibheis]', '2025-08-26', 'Reached summit in 3 hours')
(0, 'matthew', 1, 'Ben Macdui [Beinn Macduibh]', '2025-08-22', 'Sunny day')

In [31]:
#get all bags by munro
cursor.execute(munro_query)
rows = cursor.fetchall()
for row in rows[:5]:
    print(row)

(0, 'matthew', 0, 'Ben Nevis [Beinn Nibheis]', '2025-08-26')
(1, 'amy', 0, 'Ben Nevis [Beinn Nibheis]', '2025-08-20')

In [21]:
conn.close()